MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GP806/mcu.h
#define RPINR32 RPINR32
extern volatile uint16_t RPINR32 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR32BITS {
  union {
    struct {
      uint16_t SS4R:7;
    };
    struct {
      uint16_t SS4R0:1;
      uint16_t SS4R1:1;
      uint16_t SS4R2:1;
      uint16_t SS4R3:1;
      uint16_t SS4R4:1;
      uint16_t SS4R5:1;
      uint16_t SS4R6:1;
    };
  };
} RPINR32BITS;
extern volatile RPINR32BITS RPINR32bits __attribute__((__sfr__));

#define RPINR33 RPINR33
extern volatile uint16_t RPINR33 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR33BITS {
  union {
    struct {
      uint16_t IC9R:7;
      uint16_t :1;
      uint16_t IC10R:7;
    };
    struct {
      uint16_t IC9R0:1;
      uint16_t IC9R1:1;
      uint16_t IC9R2:1;
      uint16_t IC9R3:1;
      uint16_t IC9R4:1;
      uint16_t IC9R5:1;
      uint16_t IC9R6:1;
      uint16_t :1;
      uint16_t IC10R0:1;
      uint16_t IC10R1:1;
      uint16_t IC10R2:1;
      uint16_t IC10R3:1;
      uint16_t IC10R4:1;
      uint16_t IC10R5:1;
      uint16_t IC10R6:1;
    };
  };
} RPINR33BITS;
extern volatile RPINR33BITS RPINR33bits __attribute__((__sfr__));

#define RPINR34 RPINR34
extern volatile uint16_t RPINR34 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR34BITS {
  union {
    struct {
      uint16_t IC11R:7;
      uint16_t :1;
      uint16_t IC12R:7;
    };
    struct {
      uint16_t IC11R0:1;
      uint16_t IC11R1:1;
      uint16_t IC11R2:1;
      uint16_t IC11R3:1;
      uint16_t IC11R4:1;
      uint16_t IC11R5:1;
      uint16_t IC11R6:1;
      uint16_t :1;
      uint16_t IC12R0:1;
      uint16_t IC12R1:1;
      uint16_t IC12R2:1;
      uint16_t IC12R3:1;
      uint16_t IC12R4:1;
      uint16_t IC12R5:1;
      uint16_t IC12R6:1;
    };
  };
} RPINR34BITS;
extern volatile RPINR34BITS RPINR34bits __attribute__((__sfr__));

#define RPINR35 RPINR35
extern volatile uint16_t RPINR35 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR35BITS {
  union {
    struct {
      uint16_t IC13R:7;
      uint16_t :1;
      uint16_t IC14R:7;
    };
    struct {
      uint16_t IC13R0:1;
      uint16_t IC13R1:1;
      uint16_t IC13R2:1;
      uint16_t IC13R3:1;
      uint16_t IC13R4:1;
      uint16_t IC13R5:1;
      uint16_t IC13R6:1;
      uint16_t :1;
      uint16_t IC14R0:1;
      uint16_t IC14R1:1;
      uint16_t IC14R2:1;
      uint16_t IC14R3:1;
      uint16_t IC14R4:1;
      uint16_t IC14R5:1;
      uint16_t IC14R6:1;
    };
  };
} RPINR35BITS;
extern volatile RPINR35BITS RPINR35bits __attribute__((__sfr__));

#define RPINR36 RPINR36
extern volatile uint16_t RPINR36 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR36BITS {
  union {
    struct {
      uint16_t IC15R:7;
      uint16_t :1;
      uint16_t IC16R:7;
    };
    struct {
      uint16_t IC15R0:1;
      uint16_t IC15R1:1;
      uint16_t IC15R2:1;
      uint16_t IC15R3:1;
      uint16_t IC15R4:1;
      uint16_t IC15R5:1;
      uint16_t IC15R6:1;
      uint16_t :1;
      uint16_t IC16R0:1;
      uint16_t IC16R1:1;
      uint16_t IC16R2:1;
      uint16_t IC16R3:1;
      uint16_t IC16R4:1;
      uint16_t IC16R5:1;
      uint16_t IC16R6:1;
    };
  };
} RPINR36BITS;
extern volatile RPINR36BITS RPINR36bits __attribute__((__sfr__));

#define RPINR37 RPINR37
extern volatile uint16_t RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      uint16_t OCFCR:7;
    };
    struct {
      uint16_t OCFCR0:1;
      uint16_t OCFCR1:1;
      uint16_t OCFCR2:1;
      uint16_t OCFCR3:1;
      uint16_t OCFCR4:1;
      uint16_t OCFCR5:1;
      uint16_t OCFCR6:1;
    };
  };
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile uint16_t NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t NVMOP:4;
      uint16_t :8;
      uint16_t NVMSIDL:1;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t NVMOP0:1;
      uint16_t NVMOP1:1;
      uint16_t NVMOP2:1;
      uint16_t NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t NVMADR __attribute__((__sfr__));
#define NVMADRU NVMADRU
extern volatile uint16_t NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  uint16_t NVMADRU:8;
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile uint16_t NVMKEY __attribute__((__sfr__));
#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t SWDTEN:1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t VREGS:1;
  uint16_t CM:1;
  uint16_t :1;
  uint16_t VREGSF:1;
  uint16_t :2;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t LPOSCEN:1;
      uint16_t :1;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t IOLOCK:1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile uint16_t CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      uint16_t PLLPRE:5;
      uint16_t :1;
      uint16_t PLLPOST:2;
      uint16_t FRCDIV:3;
      uint16_t DOZEN:1;
      uint16_t DOZE:3;
      uint16_t ROI:1;
    };
    struct {
      uint16_t PLLPRE0:1;
      uint16_t PLLPRE1:1;
      uint16_t PLLPRE2:1;
      uint16_t PLLPRE3:1;
      uint16_t PLLPRE4:1;
      uint16_t :1;
      uint16_t PLLPOST0:1;
      uint16_t PLLPOST1:1;
      uint16_t FRCDIV0:1;
      uint16_t FRCDIV1:1;
      uint16_t FRCDIV2:1;
      uint16_t :1;
      uint16_t DOZE0:1;
      uint16_t DOZE1:1;
      uint16_t DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define PLLFBD PLLFBD
extern volatile uint16_t PLLFBD __attribute__((__sfr__));
__extension__ typedef struct tagPLLFBDBITS {
  union {
    struct {
      uint16_t PLLDIV:9;
    };
    struct {
      uint16_t PLLDIV0:1;
      uint16_t PLLDIV1:1;
      uint16_t PLLDIV2:1;
      uint16_t PLLDIV3:1;
      uint16_t PLLDIV4:1;
      uint16_t PLLDIV5:1;
      uint16_t PLLDIV6:1;
      uint16_t PLLDIV7:1;
      uint16_t PLLDIV8:1;
    };
  };
} PLLFBDBITS;
