MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GP806/mcu.h
#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
#define CNENE CNENE
extern volatile uint16_t CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  uint16_t CNIEE0:1;
  uint16_t CNIEE1:1;
  uint16_t CNIEE2:1;
  uint16_t CNIEE3:1;
  uint16_t CNIEE4:1;
  uint16_t CNIEE5:1;
  uint16_t CNIEE6:1;
  uint16_t CNIEE7:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  uint16_t CNPUE0:1;
  uint16_t CNPUE1:1;
  uint16_t CNPUE2:1;
  uint16_t CNPUE3:1;
  uint16_t CNPUE4:1;
  uint16_t CNPUE5:1;
  uint16_t CNPUE6:1;
  uint16_t CNPUE7:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  uint16_t CNPDE0:1;
  uint16_t CNPDE1:1;
  uint16_t CNPDE2:1;
  uint16_t CNPDE3:1;
  uint16_t CNPDE4:1;
  uint16_t CNPDE5:1;
  uint16_t CNPDE6:1;
  uint16_t CNPDE7:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  uint16_t ANSE0:1;
  uint16_t ANSE1:1;
  uint16_t ANSE2:1;
  uint16_t ANSE3:1;
  uint16_t ANSE4:1;
  uint16_t ANSE5:1;
  uint16_t ANSE6:1;
  uint16_t ANSE7:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t RF2:1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t LATF2:1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
  uint16_t ODCF2:1;
  uint16_t ODCF3:1;
  uint16_t ODCF4:1;
  uint16_t ODCF5:1;
  uint16_t ODCF6:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define CNENF CNENF
extern volatile uint16_t CNENF __attribute__((__sfr__));
typedef struct tagCNENFBITS {
  uint16_t CNIEF0:1;
  uint16_t CNIEF1:1;
  uint16_t CNIEF2:1;
  uint16_t CNIEF3:1;
  uint16_t CNIEF4:1;
  uint16_t CNIEF5:1;
  uint16_t CNIEF6:1;
} CNENFBITS;
extern volatile CNENFBITS CNENFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
typedef struct tagCNPUFBITS {
  uint16_t CNPUF0:1;
  uint16_t CNPUF1:1;
  uint16_t CNPUF2:1;
  uint16_t CNPUF3:1;
  uint16_t CNPUF4:1;
  uint16_t CNPUF5:1;
  uint16_t CNPUF6:1;
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile uint16_t CNPDF __attribute__((__sfr__));
typedef struct tagCNPDFBITS {
  uint16_t CNPDF0:1;
  uint16_t CNPDF1:1;
  uint16_t CNPDF2:1;
  uint16_t CNPDF3:1;
  uint16_t CNPDF4:1;
  uint16_t CNPDF5:1;
  uint16_t CNPDF6:1;
} CNPDFBITS;
extern volatile CNPDFBITS CNPDFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t :2;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t :2;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t :2;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile uint16_t ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  uint16_t :2;
  uint16_t ODCG2:1;
  uint16_t ODCG3:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define CNENG CNENG
extern volatile uint16_t CNENG __attribute__((__sfr__));
typedef struct tagCNENGBITS {
  uint16_t :2;
  uint16_t CNIEG2:1;
  uint16_t CNIEG3:1;
  uint16_t :2;
  uint16_t CNIEG6:1;
  uint16_t CNIEG7:1;
  uint16_t CNIEG8:1;
  uint16_t CNIEG9:1;
} CNENGBITS;
extern volatile CNENGBITS CNENGbits __attribute__((__sfr__));

#define CNPUG CNPUG
extern volatile uint16_t CNPUG __attribute__((__sfr__));
typedef struct tagCNPUGBITS {
  uint16_t :2;
  uint16_t CNPUG2:1;
  uint16_t CNPUG3:1;
  uint16_t :2;
  uint16_t CNPUG6:1;
  uint16_t CNPUG7:1;
  uint16_t CNPUG8:1;
  uint16_t CNPUG9:1;
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile uint16_t CNPDG __attribute__((__sfr__));
typedef struct tagCNPDGBITS {
  uint16_t :2;
  uint16_t CNPDG2:1;
  uint16_t CNPDG3:1;
  uint16_t :2;
  uint16_t CNPDG6:1;
  uint16_t CNPDG7:1;
  uint16_t CNPDG8:1;
  uint16_t CNPDG9:1;
} CNPDGBITS;
