MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GP806/mcu.h
/* PMD6 */
#define _SPI3MD PMD6bits.SPI3MD
#define _SPI4MD PMD6bits.SPI4MD

/* PMD7 */
#define _DMA0MD PMD7bits.DMA0MD
#define _DMA4MD PMD7bits.DMA4MD
#define _DMA8MD PMD7bits.DMA8MD
#define _DMA12MD PMD7bits.DMA12MD
#define _DMA1MD PMD7bits.DMA1MD
#define _DMA5MD PMD7bits.DMA5MD
#define _DMA9MD PMD7bits.DMA9MD
#define _DMA13MD PMD7bits.DMA13MD
#define _DMA2MD PMD7bits.DMA2MD
#define _DMA6MD PMD7bits.DMA6MD
#define _DMA10MD PMD7bits.DMA10MD
#define _DMA14MD PMD7bits.DMA14MD
#define _DMA3MD PMD7bits.DMA3MD
#define _DMA7MD PMD7bits.DMA7MD
#define _DMA11MD PMD7bits.DMA11MD

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _IC1IF IFS0bits.IC1IF
#define _OC1IF IFS0bits.OC1IF
#define _T1IF IFS0bits.T1IF
#define _DMA0IF IFS0bits.DMA0IF
#define _IC2IF IFS0bits.IC2IF
#define _OC2IF IFS0bits.OC2IF
#define _T2IF IFS0bits.T2IF
#define _T3IF IFS0bits.T3IF
#define _SPI1EIF IFS0bits.SPI1EIF
#define _SPI1IF IFS0bits.SPI1IF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _AD1IF IFS0bits.AD1IF
#define _DMA1IF IFS0bits.DMA1IF
#define _NVMIF IFS0bits.NVMIF

/* IFS1 */
#define _SI2C1IF IFS1bits.SI2C1IF
#define _MI2C1IF IFS1bits.MI2C1IF
#define _CMIF IFS1bits.CMIF
#define _CNIF IFS1bits.CNIF
#define _INT1IF IFS1bits.INT1IF
#define _AD2IF IFS1bits.AD2IF
#define _IC7IF IFS1bits.IC7IF
#define _IC8IF IFS1bits.IC8IF
#define _DMA2IF IFS1bits.DMA2IF
#define _OC3IF IFS1bits.OC3IF
#define _OC4IF IFS1bits.OC4IF
#define _T4IF IFS1bits.T4IF
#define _T5IF IFS1bits.T5IF
#define _INT2IF IFS1bits.INT2IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF

/* IFS2 */
#define _SPI2EIF IFS2bits.SPI2EIF
#define _SPI2IF IFS2bits.SPI2IF
#define _C1RXIF IFS2bits.C1RXIF
#define _C1IF IFS2bits.C1IF
#define _DMA3IF IFS2bits.DMA3IF
#define _IC3IF IFS2bits.IC3IF
#define _IC4IF IFS2bits.IC4IF
#define _IC5IF IFS2bits.IC5IF
#define _IC6IF IFS2bits.IC6IF
#define _OC5IF IFS2bits.OC5IF
#define _OC6IF IFS2bits.OC6IF
#define _OC7IF IFS2bits.OC7IF
#define _OC8IF IFS2bits.OC8IF
#define _PMPIF IFS2bits.PMPIF
#define _DMA4IF IFS2bits.DMA4IF
#define _T6IF IFS2bits.T6IF

/* IFS3 */
#define _T7IF IFS3bits.T7IF
#define _SI2C2IF IFS3bits.SI2C2IF
#define _MI2C2IF IFS3bits.MI2C2IF
#define _T8IF IFS3bits.T8IF
#define _T9IF IFS3bits.T9IF
#define _INT3IF IFS3bits.INT3IF
#define _INT4IF IFS3bits.INT4IF
#define _C2RXIF IFS3bits.C2RXIF
#define _C2IF IFS3bits.C2IF
#define _PSEMIF IFS3bits.PSEMIF
#define _DCIEIF IFS3bits.DCIEIF
#define _DCIIF IFS3bits.DCIIF
#define _DMA5IF IFS3bits.DMA5IF
#define _RTCIF IFS3bits.RTCIF

/* IFS4 */
#define _U1EIF IFS4bits.U1EIF
#define _U2EIF IFS4bits.U2EIF
#define _CRCIF IFS4bits.CRCIF
#define _DMA6IF IFS4bits.DMA6IF
#define _DMA7IF IFS4bits.DMA7IF
#define _C1TXIF IFS4bits.C1TXIF
#define _C2TXIF IFS4bits.C2TXIF

/* IFS5 */
#define _U3EIF IFS5bits.U3EIF
#define _U3RXIF IFS5bits.U3RXIF
#define _U3TXIF IFS5bits.U3TXIF
#define _U4EIF IFS5bits.U4EIF
#define _U4RXIF IFS5bits.U4RXIF
#define _U4TXIF IFS5bits.U4TXIF
#define _SPI3EIF IFS5bits.SPI3EIF
#define _SPI3IF IFS5bits.SPI3IF
#define _OC9IF IFS5bits.OC9IF
#define _IC9IF IFS5bits.IC9IF

/* IFS7 */
#define _DMA8IF IFS7bits.DMA8IF
#define _DMA9IF IFS7bits.DMA9IF
#define _DMA10IF IFS7bits.DMA10IF
#define _DMA11IF IFS7bits.DMA11IF
#define _SPI4EIF IFS7bits.SPI4EIF
#define _SPI4IF IFS7bits.SPI4IF
#define _OC10IF IFS7bits.OC10IF
#define _IC10IF IFS7bits.IC10IF
#define _OC11IF IFS7bits.OC11IF
#define _IC11IF IFS7bits.IC11IF

/* IFS8 */
#define _OC12IF IFS8bits.OC12IF
#define _IC12IF IFS8bits.IC12IF
#define _DMA12IF IFS8bits.DMA12IF
#define _DMA13IF IFS8bits.DMA13IF
#define _DMA14IF IFS8bits.DMA14IF
#define _OC13IF IFS8bits.OC13IF
#define _IC13IF IFS8bits.IC13IF
#define _OC14IF IFS8bits.OC14IF
#define _IC14IF IFS8bits.IC14IF
#define _OC15IF IFS8bits.OC15IF
#define _IC15IF IFS8bits.IC15IF
#define _OC16IF IFS8bits.OC16IF
#define _IC16IF IFS8bits.IC16IF
/* Bitname _ICDIF cannot be defined because it is used by more than one SFR */

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _IC1IE IEC0bits.IC1IE
#define _OC1IE IEC0bits.OC1IE
#define _T1IE IEC0bits.T1IE
#define _DMA0IE IEC0bits.DMA0IE
#define _IC2IE IEC0bits.IC2IE
#define _OC2IE IEC0bits.OC2IE
#define _T2IE IEC0bits.T2IE
#define _T3IE IEC0bits.T3IE
#define _SPI1EIE IEC0bits.SPI1EIE
#define _SPI1IE IEC0bits.SPI1IE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _AD1IE IEC0bits.AD1IE
#define _DMA1IE IEC0bits.DMA1IE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SI2C1IE IEC1bits.SI2C1IE
#define _MI2C1IE IEC1bits.MI2C1IE
#define _CMIE IEC1bits.CMIE
#define _CNIE IEC1bits.CNIE
#define _INT1IE IEC1bits.INT1IE
#define _AD2IE IEC1bits.AD2IE
#define _IC7IE IEC1bits.IC7IE
#define _IC8IE IEC1bits.IC8IE
#define _DMA2IE IEC1bits.DMA2IE
#define _OC3IE IEC1bits.OC3IE
#define _OC4IE IEC1bits.OC4IE
#define _T4IE IEC1bits.T4IE
#define _T5IE IEC1bits.T5IE
#define _INT2IE IEC1bits.INT2IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE

/* IEC2 */
#define _SPI2EIE IEC2bits.SPI2EIE
#define _SPI2IE IEC2bits.SPI2IE
#define _C1RXIE IEC2bits.C1RXIE
#define _C1IE IEC2bits.C1IE
#define _DMA3IE IEC2bits.DMA3IE
#define _IC3IE IEC2bits.IC3IE
#define _IC4IE IEC2bits.IC4IE
#define _IC5IE IEC2bits.IC5IE
#define _IC6IE IEC2bits.IC6IE
#define _OC5IE IEC2bits.OC5IE
#define _OC6IE IEC2bits.OC6IE
#define _OC7IE IEC2bits.OC7IE
#define _OC8IE IEC2bits.OC8IE
#define _PMPIE IEC2bits.PMPIE
#define _DMA4IE IEC2bits.DMA4IE
#define _T6IE IEC2bits.T6IE

/* IEC3 */
#define _T7IE IEC3bits.T7IE
#define _SI2C2IE IEC3bits.SI2C2IE
#define _MI2C2IE IEC3bits.MI2C2IE
#define _T8IE IEC3bits.T8IE
#define _T9IE IEC3bits.T9IE
#define _INT3IE IEC3bits.INT3IE
#define _INT4IE IEC3bits.INT4IE
#define _C2RXIE IEC3bits.C2RXIE
#define _C2IE IEC3bits.C2IE
#define _PSEMIE IEC3bits.PSEMIE
#define _DCIEIE IEC3bits.DCIEIE
#define _DCIIE IEC3bits.DCIIE
#define _DMA5IE IEC3bits.DMA5IE
#define _RTCIE IEC3bits.RTCIE

/* IEC4 */
#define _U1EIE IEC4bits.U1EIE
#define _U2EIE IEC4bits.U2EIE
#define _CRCIE IEC4bits.CRCIE
#define _DMA6IE IEC4bits.DMA6IE
#define _DMA7IE IEC4bits.DMA7IE
#define _C1TXIE IEC4bits.C1TXIE
#define _C2TXIE IEC4bits.C2TXIE

/* IEC5 */
#define _U3EIE IEC5bits.U3EIE
#define _U3RXIE IEC5bits.U3RXIE
#define _U3TXIE IEC5bits.U3TXIE
#define _U4EIE IEC5bits.U4EIE
#define _U4RXIE IEC5bits.U4RXIE
#define _U4TXIE IEC5bits.U4TXIE
#define _SPI3EIE IEC5bits.SPI3EIE
#define _SPI3IE IEC5bits.SPI3IE
#define _OC9IE IEC5bits.OC9IE
#define _IC9IE IEC5bits.IC9IE

/* IEC7 */
#define _DMA8IE IEC7bits.DMA8IE
#define _DMA9IE IEC7bits.DMA9IE
#define _DMA10IE IEC7bits.DMA10IE
#define _DMA11IE IEC7bits.DMA11IE
#define _SPI4EIE IEC7bits.SPI4EIE
#define _SPI4IE IEC7bits.SPI4IE
#define _OC10IE IEC7bits.OC10IE
#define _IC10IE IEC7bits.IC10IE
#define _OC11IE IEC7bits.OC11IE
#define _IC11IE IEC7bits.IC11IE

/* IEC8 */
#define _OC12IE IEC8bits.OC12IE
#define _IC12IE IEC8bits.IC12IE
#define _DMA12IE IEC8bits.DMA12IE
#define _DMA13IE IEC8bits.DMA13IE
#define _DMA14IE IEC8bits.DMA14IE
#define _OC13IE IEC8bits.OC13IE
#define _IC13IE IEC8bits.IC13IE
#define _OC14IE IEC8bits.OC14IE
#define _IC14IE IEC8bits.IC14IE
#define _OC15IE IEC8bits.OC15IE
#define _IC15IE IEC8bits.IC15IE
#define _OC16IE IEC8bits.OC16IE
#define _IC16IE IEC8bits.IC16IE
/* Bitname _ICDIF cannot be defined because it is used by more than one SFR */

