MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GP806/mcu.h
#define _RPOR2_RP68R2_POSITION                   0x00000002
#define _RPOR2_RP68R2_MASK                       0x00000004
#define _RPOR2_RP68R2_LENGTH                     0x00000001

#define _RPOR2_RP68R3_POSITION                   0x00000003
#define _RPOR2_RP68R3_MASK                       0x00000008
#define _RPOR2_RP68R3_LENGTH                     0x00000001

#define _RPOR2_RP68R4_POSITION                   0x00000004
#define _RPOR2_RP68R4_MASK                       0x00000010
#define _RPOR2_RP68R4_LENGTH                     0x00000001

#define _RPOR2_RP68R5_POSITION                   0x00000005
#define _RPOR2_RP68R5_MASK                       0x00000020
#define _RPOR2_RP68R5_LENGTH                     0x00000001

#define _RPOR2_RP69R0_POSITION                   0x00000008
#define _RPOR2_RP69R0_MASK                       0x00000100
#define _RPOR2_RP69R0_LENGTH                     0x00000001

#define _RPOR2_RP69R1_POSITION                   0x00000009
#define _RPOR2_RP69R1_MASK                       0x00000200
#define _RPOR2_RP69R1_LENGTH                     0x00000001

#define _RPOR2_RP69R2_POSITION                   0x0000000A
#define _RPOR2_RP69R2_MASK                       0x00000400
#define _RPOR2_RP69R2_LENGTH                     0x00000001

#define _RPOR2_RP69R3_POSITION                   0x0000000B
#define _RPOR2_RP69R3_MASK                       0x00000800
#define _RPOR2_RP69R3_LENGTH                     0x00000001

#define _RPOR2_RP69R4_POSITION                   0x0000000C
#define _RPOR2_RP69R4_MASK                       0x00001000
#define _RPOR2_RP69R4_LENGTH                     0x00000001

#define _RPOR2_RP69R5_POSITION                   0x0000000D
#define _RPOR2_RP69R5_MASK                       0x00002000
#define _RPOR2_RP69R5_LENGTH                     0x00000001

#define _RPOR3_RP70R_POSITION                    0x00000000
#define _RPOR3_RP70R_MASK                        0x0000003F
#define _RPOR3_RP70R_LENGTH                      0x00000006

#define _RPOR3_RP71R_POSITION                    0x00000008
#define _RPOR3_RP71R_MASK                        0x00003F00
#define _RPOR3_RP71R_LENGTH                      0x00000006

#define _RPOR3_RP70R0_POSITION                   0x00000000
#define _RPOR3_RP70R0_MASK                       0x00000001
#define _RPOR3_RP70R0_LENGTH                     0x00000001

#define _RPOR3_RP70R1_POSITION                   0x00000001
#define _RPOR3_RP70R1_MASK                       0x00000002
#define _RPOR3_RP70R1_LENGTH                     0x00000001

#define _RPOR3_RP70R2_POSITION                   0x00000002
#define _RPOR3_RP70R2_MASK                       0x00000004
#define _RPOR3_RP70R2_LENGTH                     0x00000001

#define _RPOR3_RP70R3_POSITION                   0x00000003
#define _RPOR3_RP70R3_MASK                       0x00000008
#define _RPOR3_RP70R3_LENGTH                     0x00000001

#define _RPOR3_RP70R4_POSITION                   0x00000004
#define _RPOR3_RP70R4_MASK                       0x00000010
#define _RPOR3_RP70R4_LENGTH                     0x00000001

#define _RPOR3_RP70R5_POSITION                   0x00000005
#define _RPOR3_RP70R5_MASK                       0x00000020
#define _RPOR3_RP70R5_LENGTH                     0x00000001

#define _RPOR3_RP71R0_POSITION                   0x00000008
#define _RPOR3_RP71R0_MASK                       0x00000100
#define _RPOR3_RP71R0_LENGTH                     0x00000001

#define _RPOR3_RP71R1_POSITION                   0x00000009
#define _RPOR3_RP71R1_MASK                       0x00000200
#define _RPOR3_RP71R1_LENGTH                     0x00000001

#define _RPOR3_RP71R2_POSITION                   0x0000000A
#define _RPOR3_RP71R2_MASK                       0x00000400
#define _RPOR3_RP71R2_LENGTH                     0x00000001

#define _RPOR3_RP71R3_POSITION                   0x0000000B
#define _RPOR3_RP71R3_MASK                       0x00000800
#define _RPOR3_RP71R3_LENGTH                     0x00000001

#define _RPOR3_RP71R4_POSITION                   0x0000000C
#define _RPOR3_RP71R4_MASK                       0x00001000
#define _RPOR3_RP71R4_LENGTH                     0x00000001

#define _RPOR3_RP71R5_POSITION                   0x0000000D
#define _RPOR3_RP71R5_MASK                       0x00002000
#define _RPOR3_RP71R5_LENGTH                     0x00000001

#define _RPOR4_RP80R_POSITION                    0x00000008
#define _RPOR4_RP80R_MASK                        0x00003F00
#define _RPOR4_RP80R_LENGTH                      0x00000006

#define _RPOR4_RP80R0_POSITION                   0x00000008
#define _RPOR4_RP80R0_MASK                       0x00000100
#define _RPOR4_RP80R0_LENGTH                     0x00000001

#define _RPOR4_RP80R1_POSITION                   0x00000009
#define _RPOR4_RP80R1_MASK                       0x00000200
#define _RPOR4_RP80R1_LENGTH                     0x00000001

#define _RPOR4_RP80R2_POSITION                   0x0000000A
#define _RPOR4_RP80R2_MASK                       0x00000400
#define _RPOR4_RP80R2_LENGTH                     0x00000001

#define _RPOR4_RP80R3_POSITION                   0x0000000B
#define _RPOR4_RP80R3_MASK                       0x00000800
#define _RPOR4_RP80R3_LENGTH                     0x00000001

#define _RPOR4_RP80R4_POSITION                   0x0000000C
#define _RPOR4_RP80R4_MASK                       0x00001000
#define _RPOR4_RP80R4_LENGTH                     0x00000001

#define _RPOR4_RP80R5_POSITION                   0x0000000D
#define _RPOR4_RP80R5_MASK                       0x00002000
#define _RPOR4_RP80R5_LENGTH                     0x00000001

#define _RPOR5_RP82R_POSITION                    0x00000000
#define _RPOR5_RP82R_MASK                        0x0000003F
#define _RPOR5_RP82R_LENGTH                      0x00000006

#define _RPOR5_RP84R_POSITION                    0x00000008
#define _RPOR5_RP84R_MASK                        0x00003F00
#define _RPOR5_RP84R_LENGTH                      0x00000006

#define _RPOR5_RP82R0_POSITION                   0x00000000
#define _RPOR5_RP82R0_MASK                       0x00000001
#define _RPOR5_RP82R0_LENGTH                     0x00000001

#define _RPOR5_RP82R1_POSITION                   0x00000001
#define _RPOR5_RP82R1_MASK                       0x00000002
#define _RPOR5_RP82R1_LENGTH                     0x00000001

#define _RPOR5_RP82R2_POSITION                   0x00000002
#define _RPOR5_RP82R2_MASK                       0x00000004
#define _RPOR5_RP82R2_LENGTH                     0x00000001

#define _RPOR5_RP82R3_POSITION                   0x00000003
#define _RPOR5_RP82R3_MASK                       0x00000008
#define _RPOR5_RP82R3_LENGTH                     0x00000001

